app/views/entries/_dropdown.html.erb

SELECT "categories".* FROM "categories"
---
	<%= f.label :Category%>
    <%= f.collection_select :id, Category.all, :id, :category %>