app/views/entries/new.html.erb

SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN entries ON entries.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Entry' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT entries.id FROM "entries" )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
---
    <td><%= entry.activity %></td>
    <td><%= raw entry.tag_list.map { |t| link_to t, tag_path(t) }.join(',') %></td>