app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."name" = 'book' LIMIT 1
---
   def index
   	# we have access to params[:cat_type]
   	 @category = Category.find_by_name(params[:cat_type])