app/controllers/entries_controller.rb

  def new
    if params[:tag]
    @entries = Entry.tagged_with(params[:tag])
  else
    @entries = Entry.all
---
SELECT "entries".* FROM "entries" JOIN taggings entries_taggings_faf9530 ON entries_taggings_faf9530.taggable_id = entries.id AND entries_taggings_faf9530.taggable_type = 'Entry' AND entries_taggings_faf9530.tag_id = 18
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN entries ON entries.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Entry' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT entries.id FROM "entries" )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id

  def edit
    @entry = Entry.find(params[:id])
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @entry = Entry.new(params[:entry])

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("activity", "created_at", "tags", "updated_at") VALUES (?, ?, ?, ?)  [["activity", "tra la la"], ["created_at", Sun, 13 Jan 2013 23:00:23 UTC +00:00], ["tags", "hello this is a tag"], ["updated_at", Sun, 13 Jan 2013 23:00:23 UTC +00:00]]

  def update
    @entry = Entry.find(params[:id])
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @entry = Entry.find(params[:id])
    @entry.destroy
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 2]]